BREAKFAST = ['кабачки', 'свиной фарш', 'шампиньоны', 'перепелиные яйца', 'печень трески',
             'авокадо', 'оливки зелёные', 'яйца', 'брюссельская капуста', 'бекон', 'оливки без косточек']

SUPPER = ['филе куриного бедра и морская капуста Меридиан', 'куриные крылья и кабачок',
          'свинина (вырезка) и  белокочанная капуста', 'скумбрия', 'тунец консервированный и филе горбуши',
          'лосось и  брокколи', 'свиной фарш и шампиньоны']

SPLITTED_SUPPER = []

for i in SUPPER:
    a = i.split(' и ')
    SPLITTED_SUPPER.append(a)

COMPONENTS = ['кабачки', 'свиной фарш', 'шампиньоны', 'перепелиные яйца', 'печень трески', 'авокадо', 'оливки зелёные',
              'яйца', 'брюссельская капуста', 'бекон', 'оливки без косточек',
              'филе куриного бедра и морская капуста Меридиан', 'куриные крылья и кабачок',
              'свинина (вырезка) и  белокочанная капуста', 'скумбрия', 'тунец консервированный и филе горбуши',
              'лосось и  брокколи', 'свиной фарш и шампиньоны']

BREAKFAST_PAIRS = [['САЛО 20г', 'ЛОДОЧКИ ИЗ КАБАЧКОВ'],
                   ['САЛО 20г', 'САЛАТ С ПЕЧЕНЬЮ ТРЕСКИ, ПЕРЕПЕЛИНЫМИ ЯЙЦАМИ И АВОКАДО'],
                   ['САЛО 20г', 'САЛАТ С АВОКАДО И ЯЙЦОМ'],
                   ['САЛО 20г', 'ЯЙЦА ВАРЕНЫЕ ВСМЯТКУ', 'БРЮССЕЛЬСКАЯ КАПУСТА С БЕКОНОМ'],
                   ['САЛО 20г', 'СКРЭМБЛ'],
                   ['ПИЦЦА С БЕКОНОМ И ОЛИВКАМИ']]

SUPPER_PAIRS = [["САЛО 20г", "КУРИНЫЕ ТЕФТЕЛИ", "МОРСКАЯ КАПУСТА С ЛУКОМ И ОЛИВКАМИ"],
                ["САЛО 20г", "КУРИНЫЕ КРЫЛЬЯ ЗАПЕЧЁННЫЕ", "КАБАЧОК ЗАПЕЧЁННЫЙ"],
                ["САЛО 20г", "СВИНИНА С ЦВЕТНОЙ КАПУСТОЙ", "ОВОЩНОЙ САЛАТ"],
                ["САЛО 20г", "СКУМБРИЯ С БРОККОЛИ И СОУСОМ КАРРИ"],
                ["САЛО 20г", "САЛАТ С ТУНЦОМ, АВОКАДО И РУККОЛОЙ", "РЫБНЫЕ КОТЛЕТЫ ИЗ ГОРБУШИ"],
                ["САЛО 20г", "ЛОСОСЬ ЗАПЕЧЁННЫЙ", "ОВОЩНОЕ РАГУ"],
                ["САЛО 60г ОБЯЗАТЕЛЬНО!", "СВИНЫЕ КОТЛЕТЫ", "КАПУСТА ТУШЁНАЯ С ГРИБАМИ"]]

